128MB_result_pgbench_SV.log
pgbench (17.2)
transaction type: 3_with_SAVEPOINTS.sql
scaling factor: 1
query mode: prepared
number of clients: 10
number of threads: 1
maximum number of tries: 1
duration: 3600 s
number of transactions actually processed: 421132
number of failed transactions: 0 (0.000%)
latency average = 85.452 ms
latency stddev = 79.652 ms
initial connection time = 26.675 ms
tps = 116.980520 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0  \set id random(1, 10000000)
         0.292           0  BEGIN;
         0.244           0  SAVEPOINT v1;
         7.408           0  UPDATE t1 SET name = name WHERE id = :id;
         0.235           0  SAVEPOINT v2;
         0.322           0  UPDATE t1 SET name = name WHERE id = :id;
         0.211           0  SAVEPOINT v3;
         0.302           0  UPDATE t1 SET name = name WHERE id = :id;
         0.205           0  SAVEPOINT v4;
         0.290           0  UPDATE t1 SET name = name WHERE id = :id;
         0.203           0  SAVEPOINT v5;
         0.286           0  UPDATE t1 SET name = name WHERE id = :id;
         0.200           0  SAVEPOINT v6;
         0.281           0  UPDATE t1 SET name = name WHERE id = :id;
         0.201           0  SAVEPOINT v7;
         0.278           0  UPDATE t1 SET name = name WHERE id = :id;
         0.198           0  SAVEPOINT v8;
         0.274           0  UPDATE t1 SET name = name WHERE id = :id;
         0.197           0  SAVEPOINT v9;
         0.268           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v10;
         0.268           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v11;
         0.263           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v12;
         0.261           0  UPDATE t1 SET name = name WHERE id = :id;
         0.194           0  SAVEPOINT v13;
         0.261           0  UPDATE t1 SET name = name WHERE id = :id;
         0.194           0  SAVEPOINT v14;
         0.260           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v15;
         0.259           0  UPDATE t1 SET name = name WHERE id = :id;
         0.194           0  SAVEPOINT v16;
         0.258           0  UPDATE t1 SET name = name WHERE id = :id;
         0.197           0  SAVEPOINT v17;
         0.257           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v18;
         0.256           0  UPDATE t1 SET name = name WHERE id = :id;
         0.194           0  SAVEPOINT v19;
         0.256           0  UPDATE t1 SET name = name WHERE id = :id;
         0.194           0  SAVEPOINT v20;
         0.253           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v21;
         0.254           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v22;
         0.255           0  UPDATE t1 SET name = name WHERE id = :id;
         0.193           0  SAVEPOINT v23;
         0.252           0  UPDATE t1 SET name = name WHERE id = :id;
         0.194           0  SAVEPOINT v24;
         0.253           0  UPDATE t1 SET name = name WHERE id = :id;
         0.194           0  SAVEPOINT v25;
         0.251           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v26;
         0.253           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v27;
         0.250           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v28;
         0.249           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v29;
         0.251           0  UPDATE t1 SET name = name WHERE id = :id;
         0.194           0  SAVEPOINT v30;
         0.251           0  UPDATE t1 SET name = name WHERE id = :id;
         0.197           0  SAVEPOINT v31;
         0.251           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v32;
         0.251           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v33;
         0.249           0  UPDATE t1 SET name = name WHERE id = :id;
         0.194           0  SAVEPOINT v34;
         0.250           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v35;
         0.248           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v36;
         0.251           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v37;
         0.247           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v38;
         0.251           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v39;
         0.247           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v40;
         0.248           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v41;
         0.249           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v42;
         0.247           0  UPDATE t1 SET name = name WHERE id = :id;
         0.194           0  SAVEPOINT v43;
         0.249           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v44;
         0.248           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v45;
         0.250           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v46;
         0.249           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v47;
         0.249           0  UPDATE t1 SET name = name WHERE id = :id;
         0.195           0  SAVEPOINT v48;
         0.250           0  UPDATE t1 SET name = name WHERE id = :id;
         0.197           0  SAVEPOINT v49;
         0.253           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v50;
         0.254           0  UPDATE t1 SET name = name WHERE id = :id;
         0.198           0  SAVEPOINT v51;
         0.250           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v52;
         0.251           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v53;
         0.251           0  UPDATE t1 SET name = name WHERE id = :id;
         0.196           0  SAVEPOINT v54;
         0.251           0  UPDATE t1 SET name = name WHERE id = :id;
         0.198           0  SAVEPOINT v55;
         0.252           0  UPDATE t1 SET name = name WHERE id = :id;
         0.198           0  SAVEPOINT v56;
         0.255           0  UPDATE t1 SET name = name WHERE id = :id;
         0.198           0  SAVEPOINT v57;
         0.253           0  UPDATE t1 SET name = name WHERE id = :id;
         0.197           0  SAVEPOINT v58;
         0.254           0  UPDATE t1 SET name = name WHERE id = :id;
         0.198           0  SAVEPOINT v59;
         0.256           0  UPDATE t1 SET name = name WHERE id = :id;
         0.198           0  SAVEPOINT v60;
         0.256           0  UPDATE t1 SET name = name WHERE id = :id;
         0.200           0  SAVEPOINT v61;
         0.257           0  UPDATE t1 SET name = name WHERE id = :id;
         0.202           0  SAVEPOINT v62;
         0.258           0  UPDATE t1 SET name = name WHERE id = :id;
         0.203           0  SAVEPOINT v63;
         0.261           0  UPDATE t1 SET name = name WHERE id = :id;
         0.200           0  SAVEPOINT v64;
         0.262           0  UPDATE t1 SET name = name WHERE id = :id;
         0.201           0  SAVEPOINT v65;
         0.259           0  UPDATE t1 SET name = name WHERE id = :id;
         0.200           0  SAVEPOINT v66;
         0.261           0  UPDATE t1 SET name = name WHERE id = :id;
         0.201           0  SAVEPOINT v67;
         0.264           0  UPDATE t1 SET name = name WHERE id = :id;
         0.202           0  SAVEPOINT v68;
         0.264           0  UPDATE t1 SET name = name WHERE id = :id;
         0.201           0  SAVEPOINT v69;
         0.264           0  UPDATE t1 SET name = name WHERE id = :id;
         0.201           0  SAVEPOINT v70;
         0.266           0  UPDATE t1 SET name = name WHERE id = :id;
         0.202           0  SAVEPOINT v71;
         0.266           0  UPDATE t1 SET name = name WHERE id = :id;
         0.202           0  SAVEPOINT v72;
         0.267           0  UPDATE t1 SET name = name WHERE id = :id;
         0.202           0  SAVEPOINT v73;
         0.268           0  UPDATE t1 SET name = name WHERE id = :id;
         0.204           0  SAVEPOINT v74;
         0.270           0  UPDATE t1 SET name = name WHERE id = :id;
         0.204           0  SAVEPOINT v75;
         0.270           0  UPDATE t1 SET name = name WHERE id = :id;
         0.204           0  SAVEPOINT v76;
         0.269           0  UPDATE t1 SET name = name WHERE id = :id;
         0.204           0  SAVEPOINT v77;
         0.275           0  UPDATE t1 SET name = name WHERE id = :id;
         0.203           0  SAVEPOINT v78;
         0.276           0  UPDATE t1 SET name = name WHERE id = :id;
         0.204           0  SAVEPOINT v79;
         0.272           0  UPDATE t1 SET name = name WHERE id = :id;
         0.204           0  SAVEPOINT v80;
         0.279           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v81;
         0.278           0  UPDATE t1 SET name = name WHERE id = :id;
         0.207           0  SAVEPOINT v82;
         0.278           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v83;
         0.280           0  UPDATE t1 SET name = name WHERE id = :id;
         0.208           0  SAVEPOINT v84;
         0.279           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v85;
         0.280           0  UPDATE t1 SET name = name WHERE id = :id;
         0.207           0  SAVEPOINT v86;
         0.285           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v87;
         0.283           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v88;
         0.285           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v89;
         0.288           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v90;
         0.288           0  UPDATE t1 SET name = name WHERE id = :id;
         0.209           0  SAVEPOINT v91;
         0.289           0  UPDATE t1 SET name = name WHERE id = :id;
         0.207           0  SAVEPOINT v92;
         0.288           0  UPDATE t1 SET name = name WHERE id = :id;
         0.208           0  SAVEPOINT v93;
         0.290           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v94;
         0.297           0  UPDATE t1 SET name = name WHERE id = :id;
         0.207           0  SAVEPOINT v95;
         0.292           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v96;
         0.295           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v97;
         0.296           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v98;
         0.297           0  UPDATE t1 SET name = name WHERE id = :id;
         0.206           0  SAVEPOINT v99;
         0.298           0  UPDATE t1 SET name = name WHERE id = :id;
         0.204           0  SAVEPOINT v100;
         0.296           0  UPDATE t1 SET name = name WHERE id = :id;
        31.427           0  COMMIT;